<html>
<head>
    <meta charset="utf-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

</head>
<body>


<?php

//homework
$a = 0;
$b = 3;
while ($a <= 100) {
    if ($a % $b == 0) {
        echo $a . "<br>";
    }
    ++$a;
}

$l = 0;
$m = 10;
do {
    if ($l == 0){
        echo $l ." - это ноль <br>";
    } else if ($l % 2 == 0) {
        echo $l . " - это четное число <br>";
    } else {
        echo $l . " - это нечетное число <br>";
    }
    ++$l;
} while ($l == 0 || $l <= $m);



$articles = [
        'Московская область' => 'Москва, Зеленоград, Клин',
        'Ленинградская область' => 'Санкт - Петербург, Всеволожск, Павловск, Кронштадт',
        'Рязанская область' => '...'
];


var_dump($articles);

$firstTranslit = [
        'а' => 'a',
        'б' => 'b',
        'в' => 'v',
        'г' => 'g',
        'д' => 'd',
        'е' => 'e',
        'ё' => 'jo',
        'ж' => 'zh',
        'з' => 'z',
        'и' => 'i',
        'й' => 'j',
        'к' => 'k',
        'л' => 'l',
        'м' => 'm',
        'н' => 'n',
        'о' => 'o',
        'п' => 'p',
        'р' => 'r',
        'с' => 's',
        'т' => 't',
        'у' => 'u',
        'ф' => 'f',
        'х' => 'h"',
        'ц' => 'c',
        'ч' => 'ch',
        'ш' => 'sh',
        'щ' => 'shh',
        'ъ' => '#',
        'ы' => 'y',
        'ь' => '"',
        'э' => 'je',
        'ю' => 'ju',
        'я' => 'ja'
];



function translitText($str) {
    $tr = [
        'А' => 'A','Б' => 'B','В' => 'V','Г' => 'G','Д' => 'D','Е' => 'E','Ё' => 'JO','Ж' => 'ZH','З' => 'Z','И' => 'I',
        'Й' => 'J','К' => 'K','Л' => 'L','М' => 'M','Н' => 'N','О' => 'O','П' => 'P','Р' => 'R','С' => 'S','Т' => 'T',
        'У' => 'U','Ф' => 'F','Х' => 'H','Ц' => 'TS','Ч' => 'CH','Ш' => 'SH','Щ' => 'SCH','Ъ' => '','Ы' => 'Y','Ь' => '',
        'Э' => 'JE','Ю' => 'JU','Я' => 'JA','а' => 'a','б' => 'b','в' => 'v','г' => 'g','д' => 'd','е' => 'e','ё' => 'jo','ж' => 'zh','з' => 'z','и' => 'i',
        'й' => 'j','к' => 'k','л' => 'l','м' => 'm','н' => 'n','о' => 'o','п' => 'p','р' => 'r','с' => 's','т' => 't',
        'у' => 'u','ф' => 'f','х' => 'h','ц' => 'ts','ч' => 'ch','ш' => 'sh','щ' => 'sch','ъ' => '#','ы' => 'y','ь' => '',
        'э' => 'je','ю' => 'ju','я' => 'ja',"-"=> "-", ","=> ",", " "=> "_", "."=> ".", "/"=> "_"
    ];
    return strtr($str,$tr);
}
$text = "Наш Текст";
$translit = translitText($text);
echo $translit . "<br>"; // здесь также  реализована замена пробела на нижнее подчеркивание,делал 4 задание и получилось сделать сразу в одной функции. Только потом увид что это 9 задание.

function translitText1($str) {
    $tr = [
        "-"=> "-", ","=> ",", " "=> "_", "."=> ".", "/"=> "_"
    ];
    return strtr($str,$tr);
}
$newText = "Наш Текст";
$newTranslit = translitText1($newText);
echo $newTranslit . "<br>";





//**
for ($i = 0; $i < 10; print($i++) . '<br>'){

};

/*$articles = [
    'Московская область' => 'Москва, Зеленоград, Клин',
    'Ленинградская область' => 'Санкт - Петербург, Всеволожск, Павловск, Кронштадт',
    'Рязанская область' => '...'
];
foreach ($articles as $key => $town) {
    foreach ($town as $city) {
        if (mb_substr($town, 0, 1) === "К") {
            echo $town;
        }
    }
}
*/ // здесь что-то не получилось





?>
 <ul> // это задание и 8 задание не успел((
    <li>
        <?php
/*$massive = [
  'Home',
  'Service',
  'About',
  'Works',
  'Blog'
];
for ($i = 0; $i < count($massive); $i++) {
    echo $i;
}*/
?>
</li>
</ul> ?-->




<footer>
<?php
$today = date("F j, G:i:s , Y");
echo $today . "<br>";
?>
</footer>
</body>
</html>